#include "dolphin/types.h"

typedef s64 OSTime;
typedef u32 OSTick;
typedef struct OSContext OSContext;

typedef struct OSThreadQueue
{
    void* head;
    void* tail;
} OSThreadQueue;

typedef struct OSAlarm
{
    u8 data[0x28];
} OSAlarm;

typedef void (*OSAlarmHandler)(OSAlarm* alarm, OSContext* context);
typedef void (*DSPCallback)(void* task);
typedef struct DSPTaskInfo DSPTaskInfo;

struct DSPTaskInfo
{
    volatile u32 state;         //0x00
    volatile u32 priority;      //0x04
    volatile u32 flags;         //0x08
    u16* iram_mmem_addr;        //0x0C
    u32 iram_length;            //0x10
    u32 iram_addr;               //0x14
    u16* dram_mmem_addr;        //0x18
    u32 dram_length;            //0x1C
    u32 dram_addr;               //0x20
    u16 dsp_init_vector;        //0x24
    u16 dsp_resume_vector;      //0x26
    DSPCallback init_cb;        //0x28
    DSPCallback res_cb;         //0x2C
    DSPCallback done_cb;        //0x30
    DSPCallback req_cb;         //0x34
    DSPTaskInfo* next;          //0x38
    DSPTaskInfo* prev;          //0x3C
    OSTime t_context;           //0x40
    OSTime t_task;              //0x48
};                              //0x50

typedef void (*EXICallback)(s32 chan, OSContext* context);

typedef struct DVDDiskID
{
    char gameName[4];
    char company[2];
    u8 diskNumber;
    u8 gameVersion;
    u8 streaming;
    u8 streamingBufSize;
    u8 padding[22];
} DVDDiskID;

typedef struct OSSram
{
    u16 checkSum;
    u16 checkSumInv;
    u32 ead0;
    u32 ead1;
    u32 counterBias;
    s8 displayOffsetH;
    u8 ntd;
    u8 language;
    u8 flags;
} OSSram;

typedef struct OSSramEx
{
    u8 flashID[2][12];
    u32 wirelessKeyboardID;
    u16 wirelessPadID[4];
    u8 dvdErrorCode;
    u8 _padding0;
    u8 flashIDCheckSum[2];
    u16 gbs;
    u8 _padding1[2];
} OSSramEx;

typedef struct OSResetFunctionInfo OSResetFunctionInfo;
typedef BOOL (*OSResetFunction)(BOOL);

struct OSResetFunctionInfo
{
    OSResetFunction func;
    u32 priority;
    OSResetFunctionInfo* next;
    OSResetFunctionInfo* prev;
};

typedef void (*CARDCallback)(s32 chan, s32 result);

typedef struct CARDFileInfo
{
    s32 chan;
    s32 fileNo;
    s32 offset;
    s32 length;
    u16 iBlock;
} CARDFileInfo;

typedef struct CARDDir
{
    u8 gameName[4];         //0x00
    u8 company[2];          //0x04
    u8 _padding0;           //0x06
    u8 bannerFormat;        //0x07
    u8 fileName[32];        //0x08
    u32 time;               //0x28
    u32 iconAddr;           //0x2C
    u16 iconFormat;         //0x30
    u16 iconSpeed;          //0x32
    u8 permission;          //0x34
    u8 copyTimes;           //0x35
    u16 startBlock;         //0x36
    u16 length;             //0x38
    u8 _padding1[2];        //0x3A
    u32 commentAddr;        //0x3C
} CARDDir;                 //0x40

typedef struct CARDDirCheck
{
    u8 padding0[56];
    u16 padding1;
    s16 checkCode;
    u16 checkSum;
    u16 checkSumInv;
} CARDDirCheck;

typedef struct CARDControl
{
    /* 0x000 */ BOOL attached;
    /* 0x004 */ s32 result;
    /* 0x008 */ u16 size;
    /* 0x00A */ u16 pageSize;
    /* 0x00C */ s32 sectorSize;
    /* 0x010 */ u16 cBlock;
    /* 0x012 */ u16 vendorID;
    /* 0x014 */ s32 latency;
    /* 0x018 */ u8 id[12];
    /* 0x024 */ int mountStep;
    /* 0x028 */ int formatStep;
    /* 0x02C */ u32 scramble;
    /* 0x030 */ DSPTaskInfo task;
    /* 0x080 */ void* workArea;
    /* 0x084 */ CARDDir* currentDir;
    /* 0x088 */ u16* currentFat;
    /* 0x08C */ OSThreadQueue threadQueue;
    /* 0x094 */ u8 cmd[9];
    /* 0x0A0 */ s32 cmdlen;
    /* 0x0A4 */ volatile u32 mode;
    /* 0x0A8 */ int retry;
    /* 0x0AC */ int repeat;
    /* 0x0B0 */ u32 addr;
    /* 0x0B4 */ void* buffer;
    /* 0x0B8 */ s32 xferred;
    /* 0x0BC */ u16 freeNo;
    /* 0x0BE */ u16 startBlock;
    /* 0x0C0 */ CARDFileInfo* fileInfo;
    /* 0x0C4 */ CARDCallback extCallback;
    /* 0x0C8 */ CARDCallback txCallback;
    /* 0x0CC */ CARDCallback exiCallback;
    /* 0x0D0 */ CARDCallback apiCallback;
    /* 0x0D4 */ CARDCallback xferCallback;
    /* 0x0D8 */ CARDCallback eraseCallback;
    /* 0x0DC */ CARDCallback unlockCallback;
    /* 0x0E0 */ OSAlarm alarm;
    /* 0x108 */ u32 cid;
    /* 0x10C */ const DVDDiskID* diskID;
} CARDControl;

typedef struct CARDDecParam
{
    u8* inputAddr;
    u32 inputLength;
    u32 aramAddr;
    u8* outputAddr;
} CARDDecParam;

typedef struct CARDID
{
    u8 serial[32];
    u16 deviceID;
    u16 size;
    u16 encode;
    u8 padding[470];
    u16 checkSum;
    u16 checkSumInv;
} CARDID;

typedef struct CARDStat
{
    char fileName[32];
    u32 length;
    u32 time;
    u8 gameName[4];
    u8 company[2];
    u8 bannerFormat;
    u32 iconAddr;
    u16 iconFormat;
    u16 iconSpeed;
    u32 commentAddr;
    u32 offsetBanner;
    u32 offsetBannerTlut;
    u32 offsetIcon[8];
    u32 offsetIconTlut;
    u32 offsetData;
} CARDStat;

#define CARD_FILENAME_MAX 32
#define CARD_MAX_FILE 127

#define CARD_ATTR_PUBLIC  0x04u

#define CARD_FAT_CHECKCODE 0x0002u
#define CARD_FAT_CHECKSUMINV 0x0001u
#define CARD_FAT_FREEBLOCKS 0x0003u
#define CARD_FAT_LASTSLOT 0x0004u

#define CARD_SEG_SIZE 0x200u
#define CARD_PAGE_SIZE 0x80u

