#include "functions.h"
#include <dolphin/types.h>

#define ARRAY_SIZE(arr) (sizeof(arr) / sizeof(*arr))

#define artificial_padding(lastKnownOffset, desiredOffset,                     \
                           typeofLastKnownMember)                              \
  u8 pad_to_##desiredOffset[desiredOffset - lastKnownOffset -                  \
                            sizeof(typeofLastKnownMember)]

typedef struct GmGlobalSaveData GmGlobalSaveData;
typedef struct GmGlobalData GmGlobalData;
typedef struct GmClearCheckerSharedData GmClearCheckerSharedData;
typedef struct GmMainData GmMainData;
typedef int (*GmClearCheckerPredicate)(int number);

struct GmGlobalSaveData {
  u32 _0;
  u8 pad_0[120];
  u8 clearchecker_flags[0x78];
};

struct GmGlobalData {
  u8 pad_000[0xF4];
  s32 clearchecker_total_0;
  s32 clearchecker_total_1;
  s32 clearchecker_total_2;
  s32 clearchecker_total_3;
  s32 clearchecker_total_4;
  s32 clearchecker_total_5;
  s32 clearchecker_total_6;
  s32 clearchecker_total_7;
  s32 clearchecker_total_8;
};

struct GmClearCheckerSharedData {
  u8 pad_000[0x174];
  u8 *type_tables[3];
  char type_error[0x1C];
  char source_file[0x11];
};

typedef struct {
  /* 0x000 */ u8 pad[0x22];
  /* 0x022 */ s8 _022[5];
  artificial_padding(0x22, 0x88, s8[5]);
  /* 0x022 */ int _088[5];
  artificial_padding(0x88, 0x208, int[5]);
  /* 0x208 */ int _208[5];
  /* 0x21C */ f32 _21C[5];
} GmMainData_830;

struct GmMainData {
  /* 0x000 */ u8 pad_00[0x2B];
  /* 0x02B */ s8 clearchecker_flag;
  artificial_padding(0x2b, 0x5ad, s8);
  /* 0x5AD */ s8 _5AD;
  artificial_padding(0x5ad, 0x830, s8);
  /* 0x830 */ GmMainData_830 _830;
  artificial_padding(0x830, 0xa88, GmMainData_830);
  /* 0xA88 */ s32 clearchecker_index;
  artificial_padding(0xa88, 0xa94, s32);
  /* 0xA94 */ s8 _A94;
};

extern GmClearCheckerPredicate lbl_804975B8[];
extern GmClearCheckerPredicate lbl_80497630[];
extern u8 lbl_80497674[];
extern u8 lbl_80497694[];

typedef void (*intFunc)(int);

typedef struct {
  int _0;
  intFunc _4;
  int _8;
  int _C;
} lbl_80497768_sub;

extern lbl_80497768_sub lbl_80497768[];

typedef struct {
  u32 _0;
  u32 _4;
  u32 _8;
} lbl_8058B634_s;

extern lbl_8058B634_s lbl_8058B634;
extern void *lbl_80497B9C[];

extern void OSReport(const char *, ...);
extern GmGlobalSaveData *kar_gmglobal__800076a0(int);
extern GmGlobalData *kar_gmglobal__near_8000771c(void);
extern s32 kar_shadow__near_8007b650(void);
extern u32 kar_gmmain__near_80005ce0(void);
extern void kar_gmmain__near_800064f0(void);
extern GmMainData *kar_gmmain__near_80006c14(void);
extern void kar_gmglobal__near_800088c8(s32 value);
extern void kar_lbaudio__near_8006176c(u32 sound_id);
extern u8 kar_mnclearchecker_get_main_state_or_assert_operating(void);
